input = File.read('input.txt').split

#хеш алфавита
alp = { "a" => 1, "b" => 2, "c" => 3, "d" => 4, "e" => 5, "f" => 6, "g" => 7, "h" => 8, "i" =>9, "j" => 10, "k" => 11, "l" => 12, "m" => 13, "n" => 14, "o" => 15, "p" => 16, "q" => 17, "r" => 18, "s" => 19, "t" => 20, "u" => 21, "v" => 22, "w" => 23, "x" => 24, "y" => 25, "z" => 26,
        "A" => 27, "B" => 28, "C" => 29, "D" => 30, "E" => 31, "F" => 32, "G" => 33, "H" => 34, "I" => 35, "J" => 36, "K" => 37, "L" => 38, "M" => 39, "N" => 40, "O" => 41, "P" => 42, "Q" => 43, "R" => 44, "S" => 45, "T" => 46, "U" => 47, "V" => 48, "W" => 49, "X" => 50, "Y" => 51, "Z" => 52}

#массив для всех повторяющихся букв
all = []

# массив для суммы значение букв
sum = []

input.each do |i|
  # разбиваем слово на 2 части
  b = i.chars.size

  b = b / 2

  b = b - 1
  
  # и помешаем кажду часть в 2 массива разделив на буквы
  arr1 = i[0..b]
  arr1 = arr1.chars

  arr2 = i[b+1..-1]
  arr2 = arr2.chars
  
  # сравниваем 2 массива и находим одинаковый элемент в обоих 
  upp = arr1 & arr2

  # Добавляем букву в общий массив с методом join что бы не плучился двумерный массив
  all << upp.join
end

# Каждую букву в общем массиве сравниваем с ключами и при совпадение получаем значение и помещаем в массив суммы
all.each do |i|
  alp.each_key do |key|
    if i == key
      sum = sum << alp[key]
    end
  end
end

p sum.sum